INSERT INTO artist_list 
VALUES 
(1, 'Иван Алексеев', 'Noize MC'),
(2, 'Елизавета Гырдымова', 'Монеточка'),
(3, 'Роман Билык', 'Звери'),
(4, 'Наталья Ошей', 'Хелависа'),
(5, 'Дэн Рейнольдс', 'Imagine Dragons'),
(6, 'Olivia Rodrigo', 'Olivia Rodrigo'),
(7, 'Александр Уман ', 'Би 2'),
(8, 'Найк Борзов', 'Найк Борзов');

INSERT INTO genre_list 
VALUES 
(1, 'rap'),
(2, 'pop'),
(3, 'rock'),
(4, 'folk'),
(5, 'etno'),
(6, 'pop-rock'),
(7, 'tin-pop');

INSERT INTO artist_in_genre 
VALUES 
(1, 1, 1),
(2, 2, 2),
(3, 3, 3),
(4, 4, 4),
(5, 4, 5),
(6, 5, 6),
(7, 5, 3),
(8, 6, 7),
(9, 7, 6),
(10, 8, 3);

INSERT INTO album_list 
VALUES 
(1, 'Царь горы', '2016'),
(2, 'Раскраски для взрослых', 2018),
(3, 'Одинокому везде пустыня', 2020),
(4, 'Химера', 2016),
(5, 'Origins', 2018),
(6, 'Sour', 2021),
(7, 'Мяу кисс ми', 2001),
(8, 'Капля Крови Создателя', 2020);

INSERT INTO artist_album 
VALUES 
(1, 1, 1),
(2, 2, 1),
(3, 2, 2),
(4, 3, 3),
(5, 4, 4),
(6, 5, 5),
(7, 6, 6),
(8, 7, 7),
(9, 8, 8);

INSERT INTO track_list 
VALUES 
(1, 1, 'Грабли', 277),
(2, 1, 'Чайлдфри', 243),
(3, 1, 'Питерские крыши', 214),
(4, 2, 'Нет монет', 278), 
(5, 2, 'Запорожец', 169),
(6, 3, 'Дама с собачкой', 139), 
(7, 3, 'Человек в футляре', 149),
(8, 3, 'Жизнь прекрасна', 235),
(9, 4, 'Голубая Трава', 254),
(10, 4, 'Изольда', 194),
(11, 4, 'Витраж', 249),
(12, 5, 'Natural', 189),
(13, 5, 'Cool Out', 217),
(14, 5, 'Only', 180),
(15, 6, 'Drivers License', 242),
(16, 6, 'Good 4 U', 178),
(17, 7, 'Моя любовь', 296), 
(18, 7, 'Мой рок-н-ролл', 405),
(19, 8, 'Не предел', 392),
(20, 8, 'Сверхновая', 417),
(21, 8, 'Слышу тьму', 244);

INSERT INTO collection_list 
VALUES 
(1, 'collection 1', 2016),
(2, 'collection 2', 2018),
(3, 'collection 3', 2020),
(4, 'collection 4', 2021),
(5, 'collection 5', 2001),
(6, 'collection 6', 2016),
(7, 'collection 7', 2018),
(8, 'collection 8', 2020);

INSERT INTO collection_album_track 
VALUES 
(1, 1, 1),
(2, 1, 9),
(3, 2, 4),
(4, 2, 12),
(5, 3, 6),
(6, 3, 19),
(7, 4, 15),
(8, 4, 16),
(9, 5, 17),
(10, 5, 18),
(11, 6, 2),
(12, 6, 10),
(13, 7, 5),
(14, 7, 13),
(15, 8, 7),
(16, 8, 20);














